Repository: grigory-lobkov/rtsp-camera-view
Catalog: Form1.*.resx
Languages: ru

# largeIconsToolStripMenuItem.Text
source: Large Icons
ru: Большие иконки

# smallIconsToolStripMenuItem.Text
source: Small Icons
ru: Маленькие иконки

# largeListToolStripMenuItem.Text
source: Large List
ru: Большой список

# smallListToolStripMenuItem.Text
source: Small List
ru: Компактный список

# toolStripMenuItem1.Text
source: Type View
ru: Вид

# ascendingToolStripMenuItem.Text
source: Ascending
ru: Прямая

# descendingToolStripMenuItem.Text
source: Descending
ru: Обратная

# disabledToolStripMenuItem.Text
source: Disabled
ru: Отключена

# toolStripMenuItem2.Text
source: Sorting
ru: Сортировка

# newCameraToolStripMenuItem.Text
source: New Camera
ru: Добавить камеру

# modifyCameraToolStripMenuItem.Text
source: Modify Camera
ru: Изменить камеру

# camNameShowInheritCheck.Text
source: inherit global
ru: по умолчанию

# camNameShowCheck.Text
source: show
ru: отображать

# camNameLabel.Text
source: Camera name
ru: Название камеры

# camNameTextBox.Text
source: Place of mount, view area, e.t.c.
ru: Например, место установки

# delCamLabel.Text
source: Delete camera
ru: Удалить камеру

# cancelCamButton.Text
source: Cancel
ru: Отмена

# saveCamButton.Text
source: Save
ru: Сохранить

# aspectRatioLabel.Text
source: Aspect ratio
ru: Соотношение сторон

# camEditIconLabel.Text
source: Camera icon
ru: Иконка

# rtsp2TextBox.Text
source: Ask camera vendor. Examples: rtsp://admin:1111@192.168.1.3/live/main rtsp://192.168.1.4:554/av0_0&user=admin&password=1111
ru: Узнайте у поставщика камеры. Примеры: rtsp://admin:1111@192.168.1.3/live/main rtsp://192.168.1.4:554/av0_0&user=admin&password=1111

# rtsp1TextBox.Text
source: Ask camera vendor. Examples: rtsp://admin:1111@192.168.1.3/live/sub rtsp://192.168.1.4:554/av0_1&user=admin&password=1111
ru: Узнайте у поставщика камеры. Примеры: rtsp://admin:1111@192.168.1.3/live/sub rtsp://192.168.1.4:554/av0_1&user=admin&password=1111

# camEditRtsp2Label.Text
source: Good quality RTSP connect string
ru: Подключение RTSP хорошего качества

# camEditRtsp1Label.Text
source: Bad quality RTSP connect string
ru: Подключение RTSP плохого качества

# camNameShowModifyLabel.Text
source: modify...
ru: изменить...

# camerasPage.Text
source: Sources
ru: Источники

# matrixSaveLabel.Text
source: ok
ru: ок

# matrixDimensionsLabel.Text
source: Matrix dimensions
ru: Размерность сетки

# camNameViewGlbButton.Text
source: Camera name display
ru: Отображение имени по умолчанию

# developerLinkLabel.Text
source: Developer page
ru: Страница разработчика

# commandLineHelpButton.Text
source: Command Line parameters help
ru: Параметры коммандной строки

# optionsPage.Text
source: Options
ru: Настройки

# cameraDeleteConfirm2.Text
source: You are watching this camera now. Are you sure?
ru: Данная камера сейчас отображается в окне просмотра. Вы уверенны в удалении?

# cameraDeleteConfirm1.Text
source: Do you really want to delete camera
ru: Вы действительно хотите удалить камеру

# errorSaveSettings.Text
source: Error: Can't Save settings. May be, there is no write rights for
ru: Ошибка: Не могу сохранить файл настроек. Проверьте, есть ли права на запись в файл

# errorLoadSettings.Text
source: Error: Can't Load settings. May be, there is no file
ru: Ошибка: Не могу загрузить файл настроек. Возможно файл не существует

# commandLineHelp.Text
source: Program actions, while start RTSP mosaic VLC player.exe [fullscreen] [screen=N] [autoplay] [unmute] [priority=N] fullscreen - maximize window screen=N - move window to screen number N (0,1,2,...) autoplay - automatically play positioned cameras unmute - unmute sound, if it exist on start playing priority=N - change program priority, N: 0 - Idle 1 - Below Normal 2 - Normal 3 - Above Normal 4 - High
ru: Действия программы при запуске "RTSP mosaic VLC player.exe" [fullscreen] [screen=N] [autoplay] [unmute] [priority=N] fullscreen - развернуть окно screen=N - переместить окно на экран N (0,1,2,...) autoplay - автозапуск размещенных камер unmute - отключить "без звука" при начале воспроизведения priority=N - изменить приоритет приложения, N: 0 - Фоновый 1 - Ниже нормального 2 - Нормальный 3 - Выше нормального 4 - Высокий

# hintDropCamera.Text
source: Drag camera by mouse left-button and drop somewhere on grid here
ru: Перетащите камеру из списка левой кнопкой мыши и отпустите здесь на сетке

# hintRTSP2.Text
source: Bad RTSP connect string, which produces high network load. To show in big windows. Swiching between RTSPs is automated.
ru: Подключение к камере с максимальным разре- шением создает большую нагрузку на сеть. Для отображения в больших окнах. Переключения между RTSP-потоками автоматизировано.

# hintRTSP1.Text
source: Good RTSP connect string, which produces minimal network load. To show in small windows.
ru: Подключение RTSP хорошего качества создает минимальную нагрузку на сеть. Для отображения в маленьких окошках.

# hintAddCamera.Text
source: Right-click on this area to Add new camera
ru: Сделайте в этом месте правый клик мышкой, чтобы добавить новую камеру

# hintOpenCtrl.Text
source: Open control panel to Add/View available cameras
ru: Откройте панель управления камерами, чтобы Добавить/Просмотреть список доступных камер

# errorSetCamera.Text
source: Installed VLC version is unsupported
ru: Установлена неподдерживаемая версия VLC

# errorInitVLCbadLib.Text
source: Clean your VLC and install the latest VLC Or try to get last "RTSP mosaic VLC player"
ru: Полностью удалите VLC и установите его рекомендуемую версию Или попробуйте скачать последнюю версию "RTSP mosaic VLC player"

# errorInitVLCbadLibVer.Text
source: It seems, you have unsupported version of libvlc.dll / axvlc.dll
ru: Похоже, что установленная версия libvlc.dll / axvlc.dll слишком старая

# errorInitVLCnoLib.Text
source: It seems, there is no libvlc.dll / axvlc.dll
ru: Похоже, что у вас нет libvlc.dll / axvlc.dll

# errorInitVLC.Text
source: Please, install VLC 2.1.x with Web-modules to the default installation folder ''Program Files (x86)'' or ''Program Files'' You can download VLC here: http://download.videolan.org/pub/videolan/vlc/2.1.5/win32/ Would you like to download VLC now?
ru: Пожалуйста, установите VLC версии 2.1.x с компонентом "Веб-модули" в папку по умолчанию (''Program Files (x86)'' или ''Program Files'') Вы можете загрузить VLC здесь: http://download.videolan.org/pub/videolan/vlc/2.1.5/win32/ Загрузить VLC сейчас?
